[
    {
        "Title": "MaskGAN: Towards Diverse and Interactive Facial Image Manipulation",
        "Authors": [
            "Cheng-Han Lee",
            "Ziwei Liu",
            "Lingyun Wu",
            "Ping Luo"
        ],
        "Abstract": "Facial image manipulation has achieved great progress in recent years. However, previous methods either operate on a predefined set of face attributes or leave users little freedom to interactively manipulate images. To overcome these drawbacks, we propose a novel framework termed MaskGAN, enabling diverse and interactive face manipulation. Our key insight is that semantic masks serve as a suitable intermediate representation for flexible face manipulation with fidelity preservation. MaskGAN has two main components: 1) Dense Mapping Network (DMN) and 2) Editing Behavior Simulated Training (EBST). Specifically, DMN learns style mapping between a free-form user modified mask and a target image, enabling diverse generation results. EBST models the user editing behavior on the source mask, making the overall framework more robust to various manipulated inputs. Specifically, it introduces dual-editing consistency as the auxiliary supervision signal. To facilitate extensive studies, we construct a large-scale high-resolution face dataset with fine-grained mask annotations named CelebAMask-HQ. MaskGAN is comprehensively evaluated on two challenging tasks: attribute transfer and style copy, demonstrating superior performance over other state-of-the-art methods. The code, models, and dataset are available at https://github.com/switchablenorms/CelebAMask-HQ.",
        "Keywords": [
            "Face",
            "Training",
            "Semantics",
            "Pipelines",
            "Robustness",
            "Task analysis",
            "Manifolds",
            "Interactive",
            "Face Images",
            "Dense Network",
            "Large-scale Datasets",
            "Key Insights",
            "Target Image",
            "High-resolution Dataset",
            "Use Of Face",
            "Progress In Recent Years",
            "Suitable Representation",
            "Facial Attributes",
            "Classification Accuracy",
            "Spatial Information",
            "Training Methods",
            "Latent Space",
            "Segmentation Accuracy",
            "Source Images",
            "Residual Block",
            "Intermediate Features",
            "Semantic Labels",
            "Fréchet Inception Distance",
            "Facial Components",
            "Alpha Matte",
            "Training Pipeline",
            "Identity Preservation",
            "Style Transfer",
            "Instance Normalization",
            "Latent Vector",
            "Affine Parameter"
        ],
        "No. of Cites": "551",
        "Views": 553
    },
    {
        "Title": "Autonomous Vehicles That Interact With Pedestrians: A Survey of Theory and Practice",
        "Authors": [
            "Amir Rasouli",
            "John K. Tsotsos"
        ],
        "Abstract": "One of the major challenges that autonomous cars are facing today is driving in urban environments. To make it a reality, autonomous vehicles require the ability to communicate with other road users and understand their intentions. Such interactions are essential between vehicles and pedestrians, the most vulnerable road users. Understanding pedestrian behavior, however, is not intuitive and depends on various factors, such as demographics of the pedestrians, traffic dynamics, environmental conditions, and so on. In this paper, we identify these factors by surveying pedestrian behavior studies, both the classical works on pedestrian-driver interaction and the modern ones that involve autonomous vehicles. To this end, we will discuss various methods of studying pedestrian behavior and analyze how the factors identified in the literature are interrelated. We will also review the practical applications aimed at solving the interaction problem, including design approaches for autonomous vehicles that communicate with pedestrians and visual perception and reasoning algorithms tailored to understanding pedestrian intention. Based on our findings, we will discuss the open problems and propose future research directions.",
        "Keywords": [
            "Autonomous vehicles",
            "Roads",
            "Cameras",
            "Automobiles",
            "Observers",
            "Autonomous Vehicles",
            "Road Users",
            "Pedestrian Behavior",
            "Social Norms",
            "Social Factors",
            "Group Size",
            "Presence Of Signals",
            "Light Signal",
            "Forms Of Communication",
            "Eye Contact",
            "Classical Studies",
            "Mode Of Communication",
            "Role Of Attention",
            "Speed Estimation",
            "Driver Behavior",
            "Road Width",
            "Making Eye Contact",
            "Vehicle Distance",
            "Road Structure",
            "Scene Elements",
            "Pedestrian Trajectory",
            "Presence Of Cameras",
            "Different Types Of Vehicles",
            "Pedestrian Walking",
            "Traffic Volume",
            "Intelligent Systems",
            "Vehicle Type",
            "Traffic Laws",
            "Communication Cues",
            "Information Cues",
            "Autonomous vehicles",
            "pedestrian behavior",
            "traffic interaction",
            "survey"
        ],
        "No. of Cites": "489",
        "Views": 30947
    },
    {
        "Title": "Personalized Recommendation System Based on Collaborative Filtering for IoT Scenarios",
        "Authors": [
            "Zhihua Cui",
            "Xianghua Xu",
            "Fei XUE",
            "Xingjuan Cai",
            "Yang Cao",
            "Wensheng Zhang",
            "Jinjun Chen"
        ],
        "Abstract": "Recommendation technology is an important part of the Internet of Things (IoT) services, which can provide better service for users and help users get information anytime, anywhere. However, the traditional recommendation algorithms cannot meet user's fast and accurate recommended requirements in the IoT environment. In the face of a large-volume data, the method of finding neighborhood by comparing whole user information will result in a low recommendation efficiency. In addition, the traditional recommendation system ignores the inherent connection between user's preference and time. In reality, the interest of the user varies over time. Recommendation system should provide users accurate and fast with the change of time. To address this, we propose a novel recommendation model based on time correlation coefficient and an improved K-means with cuckoo search (CSK-means), called TCCF. The clustering method can cluster similar users together for further quick and accurate recommendation. Moreover, an effective and personalized recommendation model based on preference pattern (PTCCF) is designed to improve the quality of TCCF. It can provide a higher quality recommendation by analyzing the user's behaviors. The extensive experiments are conducted on two real datasets of MovieLens and Douban, and the precision of our model have improved about 5.2 percent compared with the MCoC model. Systematic experimental results have demonstrated our models TCCF and PTCCF are effective for IoT scenarios.",
        "Keywords": [
            "Collaboration",
            "Internet of Things",
            "Data models",
            "Correlation",
            "Clustering algorithms",
            "Big Data",
            "Internet Of Things",
            "Recommender Systems",
            "Collaborative Filtering",
            "Internet Of Things Scenarios",
            "Personalized Recommendation System",
            "Clustering Method",
            "User Behavior",
            "User Preferences",
            "Preference Patterns",
            "User Interest",
            "Services For Users",
            "Recommendation Model",
            "Recommendation Accuracy",
            "Recommendation Algorithm",
            "Cuckoo Search",
            "Traditional Recommendation",
            "Big Data",
            "Effect Of Parameters",
            "Clustering Algorithm",
            "Efficient Algorithm",
            "Internet Of Things Services",
            "Correlation Time",
            "Target User",
            "Cold Start",
            "Intelligent Optimization Algorithms",
            "Singular Value Decomposition",
            "Collaborative Recommendation",
            "Fashion Trends",
            "Intelligence Algorithms",
            "Recommender systems",
            "collaborative filtering",
            "clustering model",
            "personalized recommendation"
        ],
        "No. of Cites": "378",
        "Views": 7817
    },
    {
        "Title": "Privacy-Preserving Blockchain-Based Federated Learning for IoT Devices",
        "Authors": [
            "Yang Zhao",
            "Jun Zhao",
            "Linshan Jiang",
            "Rui Tan",
            "Dusit Niyato",
            "Zengxiang Li",
            "Lingjuan Lyu",
            "Yingbo Liu"
        ],
        "Abstract": "Home appliance manufacturers strive to obtain feedback from users to improve their products and services to build a smart home system. To help manufacturers develop a smart home system, we design a federated learning (FL) system leveraging a reputation mechanism to assist home appliance manufacturers to train a machine learning model based on customers’ data. Then, manufacturers can predict customers’ requirements and consumption behaviors in the future. The working flow of the system includes two stages: in the first stage, customers train the initial model provided by the manufacturer using both the mobile phone and the mobile-edge computing (MEC) server. Customers collect data from various home appliances using phones, and then they download and train the initial model with their local data. After deriving local models, customers sign on their models and send them to the blockchain. In case customers or manufacturers are malicious, we use the blockchain to replace the centralized aggregator in the traditional FL system. Since records on the blockchain are untampered, malicious customers or manufacturers’ activities are traceable. In the second stage, manufacturers select customers or organizations as miners for calculating the averaged model using received models from customers. By the end of the crowdsourcing task, one of the miners, who is selected as the temporary leader, uploads the model to the blockchain. To protect customers’ privacy and improve the test accuracy, we enforce differential privacy (DP) on the extracted features and propose a new normalization technique. We experimentally demonstrate that our normalization technique outperforms batch normalization when features are under DP protection. In addition, to attract more customers to participate in the crowdsourcing FL task, we design an incentive mechanism to award participants.",
        "Keywords": [
            "Blockchain",
            "Computational modeling",
            "Crowdsourcing",
            "Differential privacy",
            "Home appliances",
            "Internet Of Things Devices",
            "Federated Learning",
            "Machine Learning",
            "Mobile Phone",
            "Machine Learning Models",
            "Test Accuracy",
            "Consumer Behavior",
            "Batch Normalization",
            "Smart Home",
            "Computing Services",
            "Normalization Techniques",
            "Mobile Edge Computing",
            "Home Appliances",
            "Differential Privacy",
            "Convolutional Neural Network",
            "Mobile Devices",
            "Convolutional Layers",
            "Feature Values",
            "Global Model",
            "Confidential Information",
            "Mobile Edge Computing Server",
            "Edge Server",
            "Federated Learning Model",
            "Edge Computing",
            "Secret Key",
            "MNIST Dataset",
            "Byzantine Fault Tolerance",
            "Fog Computing",
            "Amount Of Noise",
            "Updated Model",
            "Blockchain",
            "crowdsourcing",
            "differential privacy (DP)",
            "federated learning (FL)",
            "Internet of Things (IoT)",
            "mobile-edge computing (MEC)"
        ],
        "No. of Cites": "341",
        "Views": 10492
    },
    {
        "Title": "Coordinating Flexible Demand Response and Renewable Uncertainties for Scheduling of Community Integrated Energy Systems With an Electric Vehicle Charging Station: A Bi-Level Approach",
        "Authors": [
            "Yang Li",
            "Meng Han",
            "Zhen Yang",
            "Guoqing Li"
        ],
        "Abstract": "A community integrated energy system (CIES) with an electric vehicle charging station (EVCS) provides a new way for tackling growing concerns of energy efficiency and environmental pollution, it is a critical task to coordinate flexible demand response and multiple renewable uncertainties. To this end, a novel bi-level optimal dispatching model for the CIES with an EVCS in multi-stakeholder scenarios is established in this paper. In this model, an integrated demand response program is designed to promote a balance between energy supply and demand while maintaining a user comprehensive satisfaction within an acceptable range. To further tap the potential of demand response through flexibly guiding users energy consumption and electric vehicles behaviors (charging, discharging and providing spinning reserves), a dynamic pricing mechanism combining time-of-use and real-time pricing is put forward. In the solution phase, by using sequence operation theory (SOT), the original chance-constrained programming (CCP) model is converted into a readily solvable mixed-integer linear programming (MILP) formulation and finally solved by CPLEX solver. The simulation results on a practical CIES located in North China demonstrate that the presented method manages to balance the interests between CIES and EVCS via the coordination of flexible demand response and uncertain renewables.",
        "Keywords": [
            "Load management",
            "Uncertainty",
            "Optimal scheduling",
            "Pricing",
            "Electric vehicles",
            "Dispatching",
            "Electric vehicle charging",
            "State Of Charge",
            "Electric Vehicles",
            "Flexible Response",
            "Electric Vehicles Charging",
            "Electric Vehicle Charging Stations",
            "Renewable Uncertainties",
            "Flexible Demand Response",
            "Optimal Model",
            "Supply And Demand",
            "Dynamic Mechanism",
            "Mixed Integer Linear Programming",
            "Dynamic Pricing",
            "Pricing Mechanism",
            "Multiple Uncertainties",
            "Real-time Pricing",
            "Mixed Integer Linear Programming Formulation",
            "Optimal Dispatch",
            "Bi-level Model",
            "Objective Function",
            "Operational Costs",
            "Electrical Load",
            "Energy Storage Systems",
            "Heating Demand",
            "Power Demand",
            "Reserve Capacity",
            "Balanced Supply",
            "Electricity Consumption",
            "Photovoltaic Output",
            "Thermal Stress",
            "Electric Power",
            "Community integrated energy system",
            "electric vehicles",
            "optimal scheduling",
            "integrated demand response",
            "renewable uncertainties",
            "dynamic pricing",
            "bi-level programming"
        ],
        "No. of Cites": "333",
        "Views": 7519
    },
    {
        "Title": "A Survey on Beyond 5G Network With the Advent of 6G: Architecture and Emerging Technologies",
        "Authors": [
            "Anutusha Dogra",
            "Rakesh Kumar Jha",
            "Shubha Jain"
        ],
        "Abstract": "Nowadays, 5G is in its initial phase of commercialization. The 5G network will revolutionize the existing wireless network with its enhanced capabilities and novel features. 5G New Radio (5G NR), referred to as the global standardization of 5G, is presently under the 3<sup xmlns:mml=\"http://www.w3.org/1998/Math/MathML\" xmlns:xlink=\"http://www.w3.org/1999/xlink\">rd</sup> Generation Partnership Project (3GPP) and can be operable over the wide range of frequency bands from less than 6GHz to mmWave (100GHz). 3GPP mainly focuses on the three major use cases of 5G NR that are comprised of Ultra-Reliable and Low Latency Communication (uRLLC), Massive Machine Type Communication (mMTC), Enhanced Mobile Broadband (eMBB). For meeting the targets of 5G NR, multiple features like scalable numerology, flexible spectrum, forward compatibility, and ultra-lean design are added as compared to the LTE systems. This paper presents a brief overview of the added features and key performance indicators of 5G NR. The issues related to the adaptation of higher modulation schemes and inter-RAT handover synchronization are well addressed in this paper. With the consideration of these challenges, a next-generation wireless communication architecture is proposed. The architecture acts as the platform for migration towards beyond 5G/6G networks. Along with this, various technologies and applications of 6G networks are also overviewed in this paper. 6G network will incorporate Artificial intelligence (AI) based services, edge computing, quantum computing, optical wireless communication, hybrid access, and tactile services. For enabling these diverse services, a virtualized network slicing based architecture of 6G is proposed. Various ongoing projects on 6G and its technologies are also listed in this paper.",
        "Keywords": [
            "6G mobile communication",
            "Computer architecture",
            "Ultra reliable low latency communication",
            "3GPP",
            "Next generation networking",
            "New Radio",
            "5G Networks",
            "Frequency Band",
            "Wireless Networks",
            "Mobile Data",
            "Low Latency",
            "Quantum Computing",
            "Key Performance Indicators",
            "Modulation Scheme",
            "Edge Computing",
            "Low Communication",
            "Low-latency Communications",
            "Massive Machine-type Communications",
            "6G Networks",
            "Network Slicing",
            "Optical Wireless Communication",
            "System Performance",
            "Data Rate",
            "Unmanned Aerial Vehicles",
            "Mobile Users",
            "Error Vector Magnitude",
            "Haptic Communication",
            "High Data Rate",
            "Multiple Access Techniques",
            "Edge Nodes",
            "Optical Networks",
            "Terahertz Communications",
            "Internet Of Vehicles",
            "Holographic Images",
            "Network Capabilities",
            "5G",
            "5G NR",
            "eMBB",
            "mMTC",
            "uRLLC",
            "EVM",
            "inter-RAT",
            "6G",
            "network slicing",
            "Tactile Internet"
        ],
        "No. of Cites": "303",
        "Views": 24321
    },
    {
        "Title": "Communication-Efficient Federated Learning for Wireless Edge Intelligence in IoT",
        "Authors": [
            "Jed Mills",
            "Jia Hu",
            "Geyong Min"
        ],
        "Abstract": "The rapidly expanding number of Internet of Things (IoT) devices is generating huge quantities of data, but public concern over data privacy means users are apprehensive to send data to a central server for machine learning (ML) purposes. The easily changed behaviors of edge infrastructure that software-defined networking (SDN) provides makes it possible to collate IoT data at edge servers and gateways, where federated learning (FL) can be performed: building a central model without uploading data to the server. FedAvg is an FL algorithm which has been the subject of much study, however, it suffers from a large number of rounds to convergence with non-independent identically distributed (non-IID) client data sets and high communication costs per round. We propose adapting FedAvg to use a distributed form of Adam optimization, greatly reducing the number of rounds to convergence, along with the novel compression techniques, to produce communication-efficient FedAvg (CE-FedAvg). We perform extensive experiments with the MNIST/CIFAR-10 data sets, IID/non-IID client data, varying numbers of clients, client participation rates, and compression rates. These show that CE-FedAvg can converge to a target accuracy in up to 6× less rounds than similarly compressed FedAvg, while uploading up to 3× less data, and is more robust to aggressive compression. Experiments on an edge-computing-like testbed using Raspberry Pi clients also show that CE-FedAvg is able to reach a target accuracy in up to 1.7× less real time than FedAvg.",
        "Keywords": [
            "Servers",
            "Computational modeling",
            "Internet of Things",
            "Training",
            "Data models",
            "Convergence",
            "Logic gates",
            "Internet Of Things",
            "Federated Learning",
            "Adam Optimizer",
            "Extensive Experiments",
            "Internet Of Things Devices",
            "True Target",
            "Central Server",
            "Compression Rate",
            "Edge Server",
            "Data Upload",
            "Internet Of Things Data",
            "Client Data",
            "Federated Learning Algorithm",
            "Learning Rate",
            "Deep Neural Network",
            "Convolutional Layers",
            "Machine Learning Models",
            "Convergence Rate",
            "Sparsity",
            "Uniform Quantization",
            "Unmanned Aerial Vehicles",
            "Adaptive Learning Rate",
            "Communication Rounds",
            "Edge Devices",
            "Fixed Learning Rate",
            "Model Weights",
            "Batch Normalization",
            "Weight Decay",
            "Adaptive Rate",
            "Compression",
            "distributed computing",
            "edge computing",
            "federated learning (FL)",
            "Internet of Things (IoT)"
        ],
        "No. of Cites": "294",
        "Views": 8596
    },
    {
        "Title": "6G for Vehicle-to-Everything (V2X) Communications: Enabling Technologies, Challenges, and Opportunities",
        "Authors": [
            "Md. Noor-A-Rahim",
            "Zilong Liu",
            "Haeyoung Lee",
            "Mohammad Omar Khyam",
            "Jianhua He",
            "Dirk Pesch",
            "Klaus Moessner",
            "Walid Saad",
            "H. Vincent Poor"
        ],
        "Abstract": "We are on the cusp of a new era of connected autonomous vehicles with unprecedented user experiences, tremendously improved road safety and air quality, highly diverse transportation environments and use cases, and a plethora of advanced applications. Realizing this grand vision requires a significantly enhanced vehicle-to-everything (V2X) communication network that should be extremely intelligent and capable of concurrently supporting hyperfast, ultrareliable, and low-latency massive information exchange. It is anticipated that the sixth-generation (6G) communication systems will fulfill these requirements of the next-generation V2X. In this article, we outline a series of key enabling technologies from a range of domains, such as new materials, algorithms, and system architectures. Aiming for truly intelligent transportation systems, we envision that machine learning (ML) will play an instrumental role in advanced vehicular communication and networking. To this end, we provide an overview of the recent advances of ML in 6G vehicular networks. To stimulate future research in this area, we discuss the strength, open challenges, maturity, and enhancing areas of these technologies.",
        "Keywords": [
            "Vehicle-to-everything",
            "6G mobile communication",
            "NOMA",
            "Wireless communication",
            "Security",
            "Vehicle-to-infrastructure",
            "Vehicle safety",
            "Blockchains",
            "Vehicle-to-everything",
            "Autonomous aerial vehicles",
            "Visible light communication",
            "Satellites",
            "Federated learning",
            "Autonomous vehicles",
            "Haptic interfaces",
            "Enabling Technologies",
            "Communication Systems",
            "Air Quality",
            "Communication Network",
            "Autonomous Vehicles",
            "Road Safety",
            "Advanced Machine Learning",
            "Intelligent Transportation Systems",
            "Vehicular Networks",
            "Vehicular Communication",
            "Importance Of Vision",
            "Wireless Networks",
            "Base Station",
            "Quantum Computing",
            "Multiple Access",
            "Satellite Communication",
            "Federated Learning",
            "Non-orthogonal Multiple Access",
            "Radio Resource",
            "Traditional Communication",
            "V2X Communication",
            "Intelligent Reflecting Surface",
            "V2V Communication",
            "Terahertz Communications",
            "Radio Resource Management",
            "Visible Light Communication",
            "Dedicated Short Range Communication",
            "Haptic Communication",
            "Fog Nodes",
            "Massive Multiple-input Multiple-output",
            "Blockchain",
            "brain-controlled vehicle (BCV)",
            "federated learning",
            "intelligent reflective surfaces (IRSs)",
            "machine learning (ML)",
            "nonorthogonal multiple access (NOMA)",
            "quantum",
            "radio frequency (RF)-visible light communication (VLC) vehicle-to-everything (V2X)",
            "sixth-generation (6G)-V2X",
            "tactile-V2X",
            "terahertz (THz) communications",
            "unmanned-aerial-vehicle (UAV)/satelliteassisted V2X"
        ],
        "No. of Cites": "272",
        "Views": 24680
    },
    {
        "Title": "A CNN-LSTM Approach to Human Activity Recognition",
        "Authors": [
            "Ronald Mutegeki",
            "Dong Seog Han"
        ],
        "Abstract": "To understand human behavior and intrinsically anticipate human intentions, research into human activity recognition HAR) using sensors in wearable and handheld devices has intensified. The ability for a system to use as few resources as possible to recognize a user's activity from raw data is what many researchers are striving for. In this paper, we propose a holistic deep learning-based activity recognition architecture, a convolutional neural network-long short-term memory network (CNN-LSTM). This CNN-LSTM approach not only improves the predictive accuracy of human activities from raw data but also reduces the complexity of the model while eliminating the need for advanced feature engineering. The CNN-LSTM network is both spatially and temporally deep. Our proposed model achieves a 99% accuracy on the iSPL dataset, an internal dataset, and a 92 % accuracy on the UCI HAR public dataset. We also compared its performance against other approaches. It competes favorably against other deep neural network (DNN) architectures that have been proposed in the past and against machine learning models that rely on manually engineered feature datasets.",
        "Keywords": [
            "Machine learning",
            "Activity recognition",
            "Feature extraction",
            "Gyroscopes",
            "Convolution",
            "Task analysis",
            "Action Recognition",
            "Human Activity Recognition",
            "Raw Data",
            "Neural Network",
            "Machine Learning",
            "Learning Models",
            "Convolutional Neural Network",
            "Deep Neural Network",
            "Machine Learning Models",
            "Short-term Memory",
            "Long Short-term Memory Network",
            "Feature Engineering",
            "Time Series",
            "Deep Learning",
            "Support Vector Machine",
            "Convolutional Layers",
            "Accelerometer",
            "Deep Learning Models",
            "Sensor Data",
            "Long Short-term Memory",
            "Long Short-term Memory Model",
            "Time Series Classification",
            "Deep Learning Approaches",
            "Feature Extraction Techniques",
            "Softmax Loss",
            "Density Model",
            "Inertial Measurement Unit",
            "Raw Signal",
            "Dense Layer",
            "Gyroscope",
            "Human activity recognition (HAR)",
            "Convolutional neural network (CNN)",
            "Long short-term memory network (LSTM)",
            "CNN-LSTM",
            "deep learning",
            "UCI HAR dataset"
        ],
        "No. of Cites": "260",
        "Views": 7774
    },
    {
        "Title": "Hybrid CNN-LSTM Model for Short-Term Individual Household Load Forecasting",
        "Authors": [
            "Musaed Alhussein",
            "Khursheed Aurangzeb",
            "Syed Irtaza Haider"
        ],
        "Abstract": "Power grids are transforming into flexible, smart, and cooperative systems with greater dissemination of distributed energy resources, advanced metering infrastructure, and advanced communication technologies. Short-term electric load forecasting for individual residential customers plays a progressively crucial role in the operation and planning of future grids. Compared to the aggregated electrical load at the community level, the prediction of individual household electric loads is legitimately challenging because of the high uncertainty and volatility involved. Results from previous studies show that prediction using machine learning and deep learning models is far from accurate, and there is still room for improvement. We herein propose a deep learning framework based on a combination of a convolutional neural network (CNN) and long short-term memory (LSTM). The proposed hybrid CNN-LSTM model uses CNN layers for feature extraction from the input data with LSTM layers for sequence learning. The performance of our developed framework is comprehensively compared to state-of-the-art systems currently in use for short-term individual household electric load forecasting. The proposed model achieved significantly better results compared to other competing techniques. We evaluated our proposed model with the recently explored LSTM-based deep learning model on a publicly available electrical load data of individual household customers from the Smart Grid Smart City (SGSC) project. We obtained an average mean absolute percentage error (MAPE) of 40.38% for individual household electric load forecasts in comparison with the LSTM-based model that obtained an average MAPE of 44.06%. Furthermore, we evaluated the effectiveness of the proposed model on different time horizons (up to 3 h ahead). Compared to the recently developed LSTM-based model tested on the same dataset, we obtained 4.01%, 4.76%, and 5.98% improvement for one, two, and six look-forward time steps, respectively (with 2 lookback time steps). Additionally, we have performed clustering analysis based on the power consumption behavior of the energy users, which indicate that prediction accuracy could be improved by grouping and training the representative model using large amount of data. The results indicated that the proposed model outperforms the LSTM-based model for both 1 h ahead and 3 h ahead in forecasting individual household electric loads.",
        "Keywords": [
            "Load modeling",
            "Predictive models",
            "Load forecasting",
            "Forecasting",
            "Machine learning",
            "Data models",
            "Energy consumption",
            "Load Forecasting",
            "Short-term Load",
            "CNN-LSTM Model",
            "Hybrid CNN-LSTM Model",
            "Neural Network",
            "Deep Learning",
            "Time Step",
            "Learning Models",
            "Convolutional Neural Network",
            "Community Level",
            "Machine Learning Models",
            "Short-term Memory",
            "Power Consumption",
            "Deep Learning Models",
            "Mean Absolute Error",
            "Long Short-term Memory",
            "Power Grid",
            "Individual Predictors",
            "Deep Learning Framework",
            "Cooperative Control",
            "Training Data",
            "Average Power Consumption",
            "Long Short-term Memory Model",
            "Validation Data",
            "Household Clusters",
            "Evening Peak",
            "Number Of Outliers",
            "Residential Sector",
            "Load Power",
            "Smart Meters",
            "CNN",
            "deep learning framework",
            "energy consumption",
            "energy consumption forecasting",
            "individual household",
            "LSTM"
        ],
        "No. of Cites": "255",
        "Views": 15017
    },
    {
        "Title": "The inD Dataset: A Drone Dataset of Naturalistic Road User Trajectories at German Intersections",
        "Authors": [
            "Julian Bock",
            "Robert Krajewski",
            "Tobias Moers",
            "Steffen Runde",
            "Lennart Vater",
            "Lutz Eckstein"
        ],
        "Abstract": "Automated vehicles rely heavily on data-driven methods, especially for complex urban environments. Large datasets of real world measurement data in the form of road user trajectories are crucial for several tasks like road user prediction models or scenario-based safety validation. So far, though, this demand is unmet as no public dataset of urban road user trajectories is available in an appropriate size, quality and variety. By contrast, the highway drone dataset (highD) has recently shown that drones are an efficient method for acquiring naturalistic road user trajectories. Compared to driving studies or ground-level infrastructure sensors, one major advantage of using a drone is the possibility to record naturalistic behavior, as road users do not notice measurements taking place. Due to the ideal viewing angle, an entire intersection scenario can be measured with significantly less occlusion than with sensors at ground level. Therefore, we created a comprehensive, large-scale urban intersection dataset with naturalistic road user behavior using camera-equipped drones as successor of the highD dataset. The resulting dataset contains more than 13 500 road users including vehicles, bicyclists and pedestrians at intersections in Germany and is called inD. The dataset consists of 10 hours of measurement data from four intersections and is available online for non-commercial research at: https://www.inD-dataset.com.",
        "Keywords": [
            "Roads",
            "Trajectory",
            "Drones",
            "Predictive models",
            "Safety",
            "Cameras",
            "Automobiles",
            "Road Users",
            "Drone Dataset",
            "Trajectories Of Road Users",
            "Data-driven Methods",
            "Automated Vehicles",
            "Video Recordings",
            "Bounding Box",
            "Position Error",
            "Object-oriented",
            "Major Roads",
            "Bird’s Eye",
            "Digital Map",
            "Side Of The Road",
            "Recording Sites",
            "Local Coordinate System",
            "Vehicle Trajectory",
            "Interaction Datasets",
            "Users In The Dataset",
            "Trajectory Dataset",
            "4K Resolution",
            "Pedestrian Trajectory",
            "CSV File"
        ],
        "No. of Cites": "216",
        "Views": 4667
    },
    {
        "Title": "Heart Disease Prediction using Hybrid machine Learning Model",
        "Authors": [
            "M. Kavitha",
            "G. Gnaneswar",
            "R. Dinesh",
            "Y. Rohith Sai",
            "R. Sai Suraj"
        ],
        "Abstract": "Heart disease causes a significant mortality rate around the world, and it has become a health threat for many people. Early prediction of heart disease may save many lives; detecting cardiovascular diseases like heart attacks, coronary artery diseases etc., is a critical challenge by the regular clinical data analysis. Machine learning (ML) can bring an effective solution for decision making and accurate predictions. The medical industry is showing enormous development in using machine learning techniques. In the proposed work, a novel machine learning approach is proposed to predict heart disease. The proposed study used the Cleveland heart disease dataset, and data mining techniques such as regression and classification are used. Machine learning techniques Random Forest and Decision Tree are applied. The novel technique of the machine learning model is designed. In implementation, 3 machine learning algorithms are used, they are 1. Random Forest, 2. Decision Tree and 3. Hybrid model (Hybrid of random forest and decision tree). Experimental results show an accuracy level of 88.7% through the heart disease prediction model with the hybrid model. The interface is designed to get the user's input parameter to predict the heart disease, for which we used a hybrid model of Decision Tree and Random Forest.",
        "Keywords": [
            "Heart",
            "Industries",
            "Predictive models",
            "Decision trees",
            "Random forests",
            "Medical diagnostic imaging",
            "Diseases",
            "Cardiovascular Disease",
            "Machine Learning",
            "Learning Models",
            "Machine Learning Models",
            "Disease Prediction",
            "Heart Disease Prediction",
            "Hybrid Machine Learning Models",
            "Coronary Artery Disease",
            "Learning Algorithms",
            "Random Forest",
            "Health Sector",
            "Decision Tree",
            "Data Mining",
            "Machine Learning Techniques",
            "Random Forest Model",
            "Hybrid Model",
            "Random Forest Tree",
            "Random Decision Tree",
            "Root Mean Square Error",
            "Mean Square Error",
            "Decision Tree Algorithm",
            "Random Forest Regression",
            "Mean Absolute Error",
            "Training Set",
            "Machine Learning Procedure",
            "Novelty Of This Work",
            "K-nearest Neighbor",
            "Support Vector Machine",
            "Deep Learning Models",
            "Sedentary Behavior",
            "Cleveland Heart Disease Database",
            "Decision Trees",
            "Random forest",
            "Hybrid algorithm",
            "Machine learning"
        ],
        "No. of Cites": "210",
        "Views": 5397
    },
    {
        "Title": "5G Technology: Towards Dynamic Spectrum Sharing Using Cognitive Radio Networks",
        "Authors": [
            "W. S. H. M. W. Ahmad",
            "N. A. M. Radzi",
            "F. S. Samidi",
            "A. Ismail",
            "F. Abdullah",
            "M. Z. Jamaludin",
            "M. N. Zakaria"
        ],
        "Abstract": "The explosive popularity of small-cell and Internet of Everything devices has tremendously increased traffic loads. This increase has revolutionised the current network into 5G technology, which demands increased capacity, high data rate and ultra-low latency. Two of the research focus areas for meeting these demands are exploring the spectrum resource and maximising the utilisation of its bands. However, the scarcity of the spectrum resource creates a serious challenge in achieving an efficient management scheme. This work aims to conduct an in-depth survey on recent spectrum sharing (SS) technologies towards 5G development and recent 5G-enabling technologies. SS techniques are classified, and SS surveys and related studies on SS techniques relevant to 5G networks are reviewed. The surveys and studies are categorised into one of the main SS techniques on the basis of network architecture, spectrum allocation behaviour and spectrum access method. Moreover, a detailed survey on cognitive radio (CR) technology in SS related to 5G implementation is performed. For a complete survey, discussions are conducted on the issues and challenges in the current implementation of SS and CR, and the means to support efficient 5G advancement are provided.",
        "Keywords": [
            "5G mobile communication",
            "Wireless communication",
            "Massive MIMO",
            "Wireless sensor networks",
            "Internet of Things",
            "Computer architecture",
            "Resource management",
            "Wireless Networks",
            "Cognitive Networks",
            "Cognitive Radio",
            "5G Technology",
            "Dynamic Spectrum",
            "Spectrum Sharing",
            "Dynamic Spectrum Sharing",
            "Data Rate",
            "5G Networks",
            "Spectrum Resources",
            "Spectrum Allocation",
            "Ultra-low Latency",
            "Spectrum Access",
            "Service Quality",
            "Internet Of Things",
            "Mobile Network",
            "Heterogeneous Network",
            "Spectral Efficiency",
            "Orthogonal Frequency Division Multiplexing",
            "User Equipment",
            "Non-orthogonal Multiple Access",
            "Massive MIMO",
            "Mobile Edge Computing",
            "Unlicensed Spectrum",
            "D2D Communication",
            "Virtual Network Functions",
            "Medium Access Control",
            "Mobile Operators",
            "Self-organizing Network",
            "Ultra-dense Networks",
            "5G",
            "new radio",
            "spectrum sharing",
            "spectrum efficiency",
            "cognitive radio",
            "enabling technologies"
        ],
        "No. of Cites": "209",
        "Views": 18092
    },
    {
        "Title": "A Stacked GRU-RNN-Based Approach for Predicting Renewable Energy and Electricity Load for Smart Grid Operation",
        "Authors": [
            "Min Xia",
            "Haidong Shao",
            "Xiandong Ma",
            "Clarence W. de Silva"
        ],
        "Abstract": "Predictions of renewable energy (RE) generation and electricity load are critical to smart grid operation. However, the prediction task remains challenging due to the intermittent and chaotic character of RE sources, and the diverse user behavior and power consumers. This article presents a novel method for the prediction of RE generation and electricity load using improved stacked gated recurrent unit-recurrent neural network (GRU-RNN) for both univariate and multivariate scenarios. First, multiple sensitive monitoring parameters or historical electricity consumption data are selected according to the correlation analysis to form the input data. Second, a stacked GRU-RNN using a simplified GRU is constructed with improved training algorithm based on AdaGrad and adjustable momentum. The modified GRU-RNN structure and improved training method enhance training efficiency and robustness. Third, the stacked GRU-RNN is used to establish an accurate mapping between the selected variables and RE generation or electricity load due to its self-feedback connections and improved training mechanism. The proposed method is verified by using two experiments: prediction of wind power generation using multiple weather parameters and prediction of electricity load with historical energy consumption data. The experimental results demonstrate that the proposed method outperforms state-of-the-art methods of machine learning or deep learning in achieving an accurate energy prediction for effective smart grid operation.",
        "Keywords": [
            "Logic gates",
            "Training",
            "Production",
            "Smart grids",
            "Renewable energy sources",
            "Computational modeling",
            "Wind power generation",
            "Renewable Energy",
            "Renewable Generation",
            "Smart Grid",
            "Electrical Load",
            "Energy Load",
            "Operation Of Smart Grids",
            "Neural Network",
            "Energy Consumption",
            "Prediction Accuracy",
            "Deep Learning",
            "Machine Learning Methods",
            "Prediction Methods",
            "Power Generation",
            "Recurrent Neural Network",
            "Energy Generation",
            "Parameter Sensitivity",
            "Renewable Energy Sources",
            "Wind Power",
            "Prediction Task",
            "Training Algorithm",
            "Extreme Learning Machine",
            "Convolutional Neural Network",
            "Deep Belief Network",
            "Adaptive Learning Rate",
            "Input Layer",
            "Renewable Energy Production",
            "Reset Gate",
            "Learning Rate",
            "Renewable Sources",
            "Time Series Data",
            "Electricity load prediction",
            "renewable energy prediction",
            "smart grid",
            "stacked gated recurrent unit-recurrent neural network (GRU-RNN)"
        ],
        "No. of Cites": "209",
        "Views": 3790
    },
    {
        "Title": "Attention Based Vehicle Trajectory Prediction",
        "Authors": [
            "Kaouther Messaoud",
            "Itheri Yahiaoui",
            "Anne Verroust-Blondet",
            "Fawzi Nashashibi"
        ],
        "Abstract": "Self-driving vehicles need to continuously analyse the driving scene, understand the behavior of other road users and predict their future trajectories in order to plan a safe motion and reduce their reaction time. Motivated by this idea, this paper addresses the problem of vehicle trajectory prediction over an extended horizon. On highways, human drivers continuously adapt their speed and paths according to the behavior of their neighboring vehicles. Therefore, vehicles' trajectories are very correlated and considering vehicle interactions makes motion prediction possible even before the start of a clear maneuver pattern. To this end, we introduce and analyze trajectory prediction methods based on how they model the vehicles interactions. Inspired by human reasoning, we use an attention mechanism that explicitly highlights the importance of neighboring vehicles with respect to their future states. We go beyond pairwise vehicle interactions and model higher order interactions. Moreover, the existence of different goals and driving behaviors induces multiple potential futures. We exploit a combination of global and partial attention paid to surrounding vehicles to generate different possible trajectory. Experiments on highway datasets show that the proposed model outperforms the state-of-the-art performances.",
        "Keywords": [
            "Trajectory",
            "Hidden Markov models",
            "Task analysis",
            "Vehicles",
            "Vehicle dynamics",
            "Predictive models",
            "Road transportation",
            "Trajectory Prediction",
            "Vehicle Trajectory",
            "Highway",
            "Attention Mechanism",
            "Autonomous Vehicles",
            "Global Attention",
            "Future Trajectories",
            "Road Users",
            "Motion Prediction",
            "Long Short-term Memory",
            "Generative Adversarial Networks",
            "Future Behavior",
            "Hidden State",
            "Markov Decision Process",
            "Attention Map",
            "Attention Weights",
            "Vehicle Motion",
            "Lane Change",
            "Driver Behavior",
            "Vehicle Behavior",
            "Target Vehicle",
            "Attention Heads",
            "Lane Change Maneuver",
            "Vehicles In Order",
            "Left Lane",
            "Context Vector",
            "Inverse Reinforcement Learning",
            "Future Motion",
            "Multi-head Attention Mechanism",
            "Dot Product",
            "Trajectory prediction",
            "vehicles interactions",
            "recurrent networks",
            "multi-head attention",
            "multi-modality"
        ],
        "No. of Cites": "199",
        "Views": 6743
    },
    {
        "Title": "Exploring the Attack Surface of Blockchain: A Comprehensive Survey",
        "Authors": [
            "Muhammad Saad",
            "Jeffrey Spaulding",
            "Laurent Njilla",
            "Charles Kamhoua",
            "Sachin Shetty",
            "DaeHun Nyang",
            "David Mohaisen"
        ],
        "Abstract": "In this paper, we systematically explore the attack surface of the Blockchain technology, with an emphasis on public Blockchains. Towards this goal, we attribute attack viability in the attack surface to 1) the Blockchain cryptographic constructs, 2) the distributed architecture of the systems using Blockchain, and 3) the Blockchain application context. To each of those contributing factors, we outline several attacks, including selfish mining, the 51% attack, DNS attacks, distributed denial-of-service (DDoS) attacks, consensus delay (due to selfish behavior or distributed denial-of-service attacks), Blockchain forks, orphaned and stale blocks, block ingestion, wallet thefts, smart contract attacks, and privacy attacks. We also explore the causal relationships between these attacks to demonstrate how various attack vectors are connected to one another. A secondary contribution of this work is outlining effective defense measures taken by the Blockchain technology or proposed by researchers to mitigate the effects of these attacks and patch associated vulnerabilities.",
        "Keywords": [
            "Blockchain",
            "Bitcoin",
            "Delays",
            "Smart contracts",
            "Computer crime",
            "Attack Surface",
            "Smart Contracts",
            "Distributed Denial Of Service",
            "Public Blockchain",
            "Replica",
            "Fault-tolerant",
            "Secret Key",
            "Propagation Delay",
            "Peer Networks",
            "Internet Service Providers",
            "Consensus Protocol",
            "Legitimate Users",
            "P2P Network",
            "Major Attacks",
            "Race Conditions",
            "Form Of Attack",
            "Malicious Nodes",
            "Private Blockchain",
            "Blockchain System",
            "Use Of Blockchain",
            "DoS Attacks",
            "Majority Of Networks",
            "Fraudulent Activities",
            "Client Software",
            "Internet Of Things",
            "Major Nodes",
            "Permissioned Blockchain",
            "Blockchain",
            "security",
            "attack surface",
            "applications",
            "peer-to-peer systems"
        ],
        "No. of Cites": "197",
        "Views": 5462
    },
    {
        "Title": "Anomaly-Based Intrusion Detection From Network Flow Features Using Variational Autoencoder",
        "Authors": [
            "Sultan Zavrak",
            "Murat İskefiyeli"
        ],
        "Abstract": "The rapid increase in network traffic has recently led to the importance of flow-based intrusion detection systems processing a small amount of traffic data. Furthermore, anomaly-based methods, which can identify unknown attacks are also integrated into these systems. In this study, the focus is concentrated on the detection of anomalous network traffic (or intrusions) from flow-based data using unsupervised deep learning methods with semi-supervised learning approach. More specifically, Autoencoder and Variational Autoencoder methods were employed to identify unknown attacks using flow features. In the experiments carried out, the flow-based features extracted out of network traffic data, including typical and different types of attacks, were used. The Receiver Operating Characteristics (ROC) and the area under ROC curve, resulting from these methods were calculated and compared with One-Class Support Vector Machine. The ROC curves were examined in detail to analyze the performance of the methods in various threshold values. The experimental results show that Variational Autoencoder performs, for the most part, better than Autoencoder and One-Class Support Vector Machine.",
        "Keywords": [
            "Intrusion detection",
            "Feature extraction",
            "Telecommunication traffic",
            "Deep learning",
            "Support vector machines",
            "Anomaly detection",
            "Computer hacking",
            "Flow Characteristics",
            "Network Flow",
            "Variational Autoencoder",
            "Intrusion Detection",
            "Anomaly-based Intrusion Detection",
            "Network Flow Features",
            "Receiver Operating Characteristic Curve",
            "Receiver Operating Characteristic",
            "Support Vector Machine",
            "Unsupervised Learning",
            "Types Of Attacks",
            "Small Amount Of Data",
            "Semi-supervised Learning",
            "Traffic Data",
            "Intrusion Detection System",
            "Different Types Of Attacks",
            "Neural Network",
            "Random Variables",
            "Data Normalization",
            "Training Dataset",
            "Anomaly Detection",
            "Anomaly Score",
            "Latent Space",
            "High False Alarm",
            "Normal Flow",
            "DoS Attacks",
            "Latent Variables",
            "Artificial Neural Network",
            "User Behavior",
            "Flow anomaly detection",
            "intrusion detection",
            "deep learning",
            "variational autoencoder",
            "semi-supervised learning"
        ],
        "No. of Cites": "171",
        "Views": 10539
    },
    {
        "Title": "Contrastive Learning for Sequential Recommendation",
        "Authors": [
            "Xu Xie",
            "Fei Sun",
            "Zhaoyang Liu",
            "Shiwen Wu",
            "Jinyang Gao",
            "Jiandong Zhang",
            "Bolin Ding",
            "Bin Cui"
        ],
        "Abstract": "Sequential recommendation methods play a crucial role in modern recommender systems because of their ability to capture a user's dynamic interest from her/his historical inter-actions. Despite their success, we argue that these approaches usually rely on the sequential prediction task to optimize the huge amounts of parameters. They usually suffer from the data sparsity problem, which makes it difficult for them to learn high-quality user representations. To tackle that, inspired by recent advances of contrastive learning techniques in the computer vision, we propose a novel multi-task framework called Contrastive Learning for Sequential Recommendation (CL4SRec). CL4SRec not only takes advantage of the traditional next item prediction task but also utilizes the contrastive learning framework to derive self-supervision signals from the original user behavior sequences. Therefore, it can extract more meaningful user patterns and further encode the user representations effectively. In addition, we propose three data augmentation approaches to construct self-supervision signals. Extensive experiments on four public datasets demonstrate that CL4SRec achieves state-of-the-art performance over existing baselines by inferring better user representations.",
        "Keywords": [
            "Computer vision",
            "Conferences",
            "Multitasking",
            "Data engineering",
            "Data models",
            "Behavioral sciences",
            "Data mining",
            "Self-supervised Learning",
            "Sequential Recommendation",
            "Computer Vision",
            "Sequencing Methods",
            "Public Datasets",
            "Learning Framework",
            "Data Augmentation",
            "User Behavior",
            "Prediction Task",
            "Recommender Systems",
            "Sequential Task",
            "Behavioral Sequences",
            "History Of Interactions",
            "User Representation",
            "Data Sparsity Problem",
            "Human-computer Interaction",
            "Sequential Model",
            "Latent Space",
            "Learnable Parameters",
            "Unlabeled Data",
            "Contrastive Loss",
            "Historical Sequence",
            "Augmentation Methods",
            "Graph Neural Networks",
            "Sequence Of Items",
            "Sparse Datasets",
            "Computer Vision Area",
            "Self-supervised Task",
            "Complicated Patterns",
            "Augmentation Operations",
            "Contrastive Learning",
            "Deep Learning",
            "Recom-mender Systems"
        ],
        "No. of Cites": "168",
        "Views": 5145
    },
    {
        "Title": "Privacy-Enhanced Federated Learning Against Poisoning Adversaries",
        "Authors": [
            "Xiaoyuan Liu",
            "Hongwei Li",
            "Guowen Xu",
            "Zongqi Chen",
            "Xiaoming Huang",
            "Rongxing Lu"
        ],
        "Abstract": "Federated learning (FL), as a distributed machine learning setting, has received considerable attention in recent years. To alleviate privacy concerns, FL essentially promises that multiple parties jointly train the model by exchanging gradients rather than raw data. However, intrinsic privacy issue still exists in FL, e.g., user’s training samples could be revealed by solely inferring gradients. Moreover, the emerging poisoning attack also poses a crucial security threat to FL. In particular, due to the distributed nature of FL, malicious users may submit crafted gradients during the training process to undermine the integrity and availability of the model. Furthermore, there exists a contradiction in simultaneously addressing two issues, that is, privacy-preserving FL solutions are dedicated to ensuring gradients indistinguishability, whereas the defenses against poisoning attacks tend to remove outliers based on their similarity. To solve such a dilemma, in this paper, we aim to build a bridge between the two issues. Specifically, we present a privacy-enhanced FL (PEFL) framework that adopts homomorphic encryption as the underlying technology and provides the server with a channel to punish poisoners via the effective gradient data extraction of the logarithmic function. To the best of our knowledge, the PEFL is the first effort to efficiently detect the poisoning behaviors in FL under ciphertext. Detailed theoretical analyses illustrate the security and convergence properties of the scheme. Moreover, the experiments conducted on real-world datasets show that the PEFL can effectively defend against label-flipping and backdoor attacks, two representative poisoning attacks in FL.",
        "Keywords": [
            "Training",
            "Data privacy",
            "Privacy",
            "Servers",
            "Security",
            "Computational modeling",
            "Data models",
            "Federated Learning",
            "Privacy Issues",
            "Availability Of Models",
            "Malicious Users",
            "Federated Learning Framework",
            "Accuracy Of Model",
            "Data Privacy",
            "Stochastic Gradient Descent",
            "Target Class",
            "Secret Key",
            "Communication Cost",
            "Public Key",
            "Communication Overhead",
            "Differential Privacy",
            "Multi-party Computation",
            "Security Parameter",
            "Adaptive Learning Rate",
            "Source Class",
            "Communication Rounds",
            "Protocol Execution",
            "Attack Success Rate",
            "Aggregation Parameter",
            "Probabilistic Polynomial Time",
            "Global Update",
            "Local Gradient",
            "Benign Ones",
            "Identical Distribution",
            "Pearson Correlation",
            "Chosen-plaintext",
            "Federated learning",
            "poisoning attack",
            "privacy protection",
            "cloud computing"
        ],
        "No. of Cites": "166",
        "Views": 7556
    },
    {
        "Title": "A Multi-User Mobile Computation Offloading and Transmission Scheduling Mechanism for Delay-Sensitive Applications",
        "Authors": [
            "Changyan Yi",
            "Jun Cai",
            "Zhou Su"
        ],
        "Abstract": "In this paper, a mobile edge computing framework with multi-user computation offloading and transmission scheduling for delay-sensitive applications is studied. In the considered model, computation tasks are generated randomly at mobile users along the time. For each task, the mobile user can choose to either process it locally or offload it via the uplink transmission to the edge for cloud computing. To efficiently manage the system, the network regulator is required to employ a network-wide optimal scheme for computation offloading and transmission scheduling while guaranteeing that all mobile users would like to follow (as they may naturally behave strategically for benefiting themselves). By considering tradeoffs between local and edge computing, wireless features and noncooperative game interactions among mobile users, we formulate a mechanism design problem to jointly determine a computation offloading scheme, a transmission scheduling discipline, and a pricing rule. A queueing model is built to analytically describe the packet-level network dynamics. Based on this, we propose a novel mechanism, which can maximize the network social welfare (i.e., the network-wide performance), while achieving a game equilibrium among strategic mobile users. Theoretical and simulation results examine the performance of our proposed mechanism, and demonstrate its superiority over the counterparts.",
        "Keywords": [
            "Task analysis",
            "Edge computing",
            "Processor scheduling",
            "Delays",
            "Computational modeling",
            "Cloud computing",
            "Dynamic scheduling",
            "Mechanical Applications",
            "Computation Offloading",
            "Transmission Scheduling",
            "Delay-sensitive Applications",
            "Mobile Computation Offloading",
            "Social Security",
            "Optimal Strategy",
            "Cloud Computing",
            "Mobile Users",
            "Computation Tasks",
            "Edge Computing",
            "Local Computing",
            "Scheduling Algorithm",
            "Queueing System",
            "Mobile Edge Computing",
            "Uplink Transmission",
            "Non-cooperative Game",
            "Offloading Strategy",
            "Total Cost",
            "Mobile Devices",
            "Delay Cost",
            "Wireless Access",
            "User Cost",
            "Wireless Networks",
            "Rational Choice Theory",
            "Strategic Behavior",
            "Task Offloading",
            "Wireless Transmission",
            "User Tasks",
            "Finite Mean",
            "Mobile dge computing",
            "computation offloading",
            "transmission scheduling",
            "delay sensitive",
            "mechanism design",
            "game"
        ],
        "No. of Cites": "164",
        "Views": 4094
    },
    {
        "Title": "Secure Data Encryption Based on Quantum Walks for 5G Internet of Things Scenario",
        "Authors": [
            "Ahmed A. Abd El-Latif",
            "Bassem Abd-El-Atty",
            "Wojciech Mazurczyk",
            "Carol Fung",
            "Salvador E. Venegas-Andraca"
        ],
        "Abstract": "Fifth generation (5G) networks are the base communication technology for connecting objects in the Internet of Things (IoT) environment. 5G is being developed to provide extremely large capacity, robust integrity, high bandwidth, and low latency. With the development and innovating new techniques for 5G-IoT, it surely will drive to new enormous security and privacy challenges. Consequently, secure techniques for data transmissions will be needed as the basis for 5G-IoT technology to address these arising challenges. Therefore, various traditional security mechanisms are provided for 5G-IoT technologies and most of them are built on mathematical foundations. With the growth of quantum technologies, traditional cryptographic techniques may be compromised due to their mathematical computation based construction. Quantum walks (QWs) is a universal quantum computational model, which possesses inherent cryptographic features that can be utilized to build efficient cryptographic mechanisms. In this paper, we use the features of quantum walk to construct a new S-box method which plays a significant role in block cipher techniques for 5G-IoT technologies. As an application of the presented S-box mechanism and controlled alternate quantum walks (CAQWs) for 5G-IoT technologies a new robust video encryption mechanism is proposed. As well as to fulfill needs of encryption for varied files in 5G-IoT, we utilize the features of quantum walk to propose a novel encryption strategy for secure transmission of sensitive files in 5G-IoT paradigm. The analyses and results of the proposed cryptosystems show that it has better security properties and efficacy in terms of cryptographic performance.",
        "Keywords": [
            "Quantum computing",
            "Encryption",
            "5G mobile communication",
            "Internet of Things",
            "Computer science",
            "Internet Of Things",
            "Data Security",
            "Encrypted Data",
            "Quantum Walk",
            "5G Internet Of Things",
            "Quantum Computing",
            "5G Networks",
            "Quantum Technologies",
            "Cryptosystem",
            "Encryption Scheme",
            "Block Cipher",
            "Cloud Computing",
            "Hilbert Space",
            "Hash Function",
            "Physical Resources",
            "Internet Of Things Devices",
            "Sequence Of Frames",
            "Information Entropy",
            "Chaotic System",
            "Probability Matrix",
            "Encrypted File",
            "Image Encryption",
            "Pseudo-random Number Generator",
            "Cloud Users",
            "Key Space",
            "Brute-force Attacks",
            "Histogram Analysis",
            "Secure Way",
            "Pseudo-random Number",
            "Evolution Operator",
            "5G networks",
            "IoT",
            "video encryption",
            "quantum walks",
            "security analysis"
        ],
        "No. of Cites": "164",
        "Views": 2312
    },
    {
        "Title": "Secure Health Data Sharing for Medical Cyber-Physical Systems for the Healthcare 4.0",
        "Authors": [
            "Han Qiu",
            "Meikang Qiu",
            "Meiqin Liu",
            "Gerard Memmi"
        ],
        "Abstract": "The recent spades of cyber attacks have compromised end-users' data security and privacy in Medical Cyber-Physical Systems (MCPS) in the era of Health 4.0. Traditional standard encryption algorithms for data protection are designed based on a viewpoint of system architecture rather than a viewpoint of end-users. As such encryption algorithms are transferring the protection on the data to the protection on the keys, data safety, and privacy will be compromised once the key is exposed. In this paper, we propose a secure data storage and sharing method consisted of a selective encryption algorithm combined with fragmentation and dispersion to protect the data safety and privacy even when both transmission media (e.g. cloud servers) and keys are compromised. This method is based on a user-centric design that protects the data on a trusted device such as the end-users' smartphone and lets the end-user control the access for data sharing. We also evaluate the performance of the algorithm on a smartphone platform to prove efficiency.",
        "Keywords": [
            "Cloud computing",
            "Data privacy",
            "Servers",
            "Safety",
            "Medical services",
            "Encryption",
            "Medical devices",
            "Health Data",
            "Data Sharing",
            "Cyber-physical Systems",
            "Medical Cyber-physical Systems",
            "Medical Systems",
            "Data Protection",
            "Data Storage",
            "Cloud Computing",
            "Data Privacy",
            "Safety Data",
            "Transmission Medium",
            "Electronic Health Records",
            "Medical Data",
            "Partial Data",
            "User Behavior",
            "Plaintext",
            "Access Control",
            "Entropy Values",
            "Information Leakage",
            "Computation Tasks",
            "Electronic Health Record Data",
            "Mobile Edge Computing",
            "Worse Case",
            "Pseudo-random Number Generator",
            "Key Distribution",
            "Encryption Key",
            "Pseudo-random Number",
            "Public Cloud",
            "Protection Methods",
            "Personal Devices",
            "Data security",
            "medical CPS",
            "health 4.0",
            "selective encryption",
            "data privacy",
            "Computer Security",
            "Confidentiality",
            "Delivery of Health Care",
            "Electronic Health Records",
            "Humans",
            "Information Dissemination"
        ],
        "No. of Cites": "163",
        "Views": 2846
    },
    {
        "Title": "User-Oriented Virtual Mobile Network Resource Management for Vehicle Communications",
        "Authors": [
            "Huimin Lu",
            "Yin Zhang",
            "Yujie Li",
            "Chi Jiang",
            "Haider Abbas"
        ],
        "Abstract": "Currently, advanced communications and networks greatly enhance user experiences and have a major impact on all aspects of people's lifestyles in terms of work, society, and the economy. However improving competitiveness and sustainable vehicle network services, such as higher user experience, considerable resource utilization and effective personalized services, is a great challenge. Addressing these issues, this paper proposes a virtual network resource management based on user behavior to further optimize the existing vehicle communications. In particular, ensemble learning is implemented in the proposed scheme to predict the user's voice call duration and traffic usage for supporting user-centric mobile services optimization. Sufficient experiments show that the proposed scheme can significantly improve the quality of services and experiences and that it provides a novel idea for optimizing vehicle networks.",
        "Keywords": [
            "5G mobile communication",
            "Optimization",
            "Industries",
            "Resource management",
            "Quality of service",
            "Network architecture",
            "Mobile Network",
            "Network Resources",
            "Vehicle Communication",
            "Network Resource Management",
            "Service Quality",
            "Resource Utilization",
            "User Experience",
            "User Behavior",
            "Quality Of Experience",
            "Network Services",
            "Personal Services",
            "Advanced Communication",
            "Vehicle Network",
            "Call Duration",
            "Training Data",
            "Resource Allocation",
            "Training Dataset",
            "Numerical Data",
            "User Groups",
            "Types Of Networks",
            "Virtual Network Functions",
            "Mobile Users",
            "LightGBM",
            "Mobile Communication",
            "Optimal Network",
            "Number Of Months",
            "User Characteristics",
            "5G Networks",
            "Insufficient Resources",
            "Dynamic Allocation",
            "Vehicle networks",
            "network optimization",
            "resource utilization",
            "data analytics",
            "artificial intelligence"
        ],
        "No. of Cites": "156",
        "Views": 1352
    },
    {
        "Title": "A Systematic Literature Review on Cloud Computing Security: Threats and Mitigation Strategies",
        "Authors": [
            "Bader Alouffi",
            "Muhammad Hasnain",
            "Abdullah Alharbi",
            "Wael Alosaimi",
            "Hashem Alyami",
            "Muhammad Ayaz"
        ],
        "Abstract": "Cloud computing has become a widely exploited research area in academia and industry. Cloud computing benefits both cloud services providers (CSPs) and consumers. The security challenges associated with cloud computing have been widely studied in the literature. This systematic literature review (SLR) is aimed to review the existing research studies on cloud computing security, threats, and challenges. This SLR examined the research studies published between 2010 and 2020 within the popular digital libraries. We selected 80 papers after a meticulous screening of published works to answer the proposed research questions. The outcomes of this SLR reported seven major security threats to cloud computing services. The results showed that data tampering and leakage were among the highly discussed topics in the chosen literature. Other identified security risks were associated with the data intrusion and data storage in the cloud computing environment. This SLR’s results also indicated that consumers’ data outsourcing remains a challenge for both CSPs and cloud users. Our survey paper identified the blockchain as a partnering technology to alleviate security concerns. The SLR findings reveal some suggestions to be carried out in future works to bring data confidentiality, data integrity, and availability.",
        "Keywords": [
            "Cloud computing",
            "Security",
            "Computational modeling",
            "Information technology",
            "Law",
            "Cloud computing security",
            "Authentication",
            "Systematic Review",
            "Cloud Computing",
            "Mitigation Strategies",
            "Multi-party Computation",
            "Cloud Computing Security",
            "Service Providers",
            "Data Integration",
            "Data Storage",
            "Confidential Information",
            "Digital Library",
            "Information Leakage",
            "Security Threats",
            "Consumption Of Services",
            "Security Risks",
            "Paper Surveys",
            "Security Challenges",
            "Cloud Users",
            "Internet Of Things",
            "Data Privacy",
            "Intrusion Detection System",
            "Blockchain Technology",
            "Security Issues",
            "Cloud Providers",
            "Security Approach",
            "Smart Contracts",
            "Virtual Machines",
            "Identity Management",
            "Intrusion Detection",
            "Data Security",
            "Auditing",
            "cloud computing",
            "cloud models",
            "decryption",
            "encryption",
            "malicious behavior",
            "intrusion",
            "secured communication"
        ],
        "No. of Cites": "155",
        "Views": 52379
    },
    {
        "Title": "Hybrid LiFi and WiFi Networks: A Survey",
        "Authors": [
            "Xiping Wu",
            "Mohammad Dehghani Soltani",
            "Lai Zhou",
            "Majid Safari",
            "Harald Haas"
        ],
        "Abstract": "In order to tackle the rapidly growing number of mobile devices and their expanding demands for Internet services, network convergence is envisaged to integrate different technology domains. For indoor wireless communications, one promising approach is to coordinate light fidelity (LiFi) and wireless fidelity (WiFi), namely hybrid LiFi and WiFi networks (HLWNets). This hybrid network combines the high-speed data transmission of LiFi and the ubiquitous coverage of WiFi. In this article, we present a survey-style introduction to HLWNets, starting with a framework of system design in the aspects of network architectures, cell deployments, multiple access and modulation schemes, illumination requirements and backhaul. Key performance metrics and recent achievements are then reviewed to demonstrate the superiority of HLWNets against stand-alone networks. Further, the unique challenges facing HLWNets are elaborated on key research topics including user behavior modeling, interference management, handover and load balancing. Moreover, the potential of HLWNets in the application areas is presented, exemplified by indoor positioning and physical layer security. Finally, the challenges and future research directions are discussed.",
        "Keywords": [
            "Light fidelity",
            "Wireless fidelity",
            "Handover",
            "Computer architecture",
            "Microprocessors",
            "Load management",
            "Interference",
            "Wi-Fi Network",
            "Performance Metrics",
            "User Behavior",
            "Design Framework",
            "Multiple Access",
            "Modulation Scheme",
            "Physical Layer",
            "Load Balancing",
            "Key Metrics",
            "Indoor Localization",
            "Hybrid Network",
            "Physical Layer Security",
            "Multiple Access Scheme",
            "Interference Management",
            "Key Performance Metrics",
            "Data Rate",
            "Internet Of Things",
            "Network Performance",
            "Channel State",
            "Mobile Users",
            "Single Access Point",
            "Signal-to-interference-plus-noise Ratio",
            "Visible Light Communication",
            "Wireless Technologies",
            "Quantum Key Distribution",
            "Spectral Efficiency",
            "Time Division Multiple Access",
            "Successive Interference Cancellation",
            "Orthogonal Frequency Division Multiplexing",
            "Visible Light Communication System",
            "Light fidelity (LiFi)",
            "wireless fidelity (WiFi)",
            "visible light communication (VLC)",
            "radio frequency (RF)",
            "optical wireless communication (OWC)",
            "hybrid network",
            "heterogeneous network",
            "network convergence",
            "handover",
            "load balancing"
        ],
        "No. of Cites": "155",
        "Views": 14861
    }
]